# Import Modules

In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [9]:
n_rows= 5
n_cols= 5
cols= tuple('ABCDE')
df= pd.DataFrame(np.random.randint(1,10,size=(n_rows,n_cols)),
                 columns= cols)
df

   A  B  C  D  E
0  1  5  6  4  9
1  6  3  3  4  1
2  3  8  6  7  2
3  4  4  5  1  4
4  6  8  5  6  4

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [13]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  5     6  4  9
1  6  3     3  4  1
2  3  8     6  7  2
3  4  4     5  1  4
4  6  8     5  6  4

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [15]:
df.rename(columns={'A':'Nama','B':'Alamat','D':'Kota'})

   Nama  Alamat  C  Kota  E
0     1       5  6     4  9
1     6       3  3     4  1
2     3       8  6     7  2
3     4       4  5     1  4
4     6       8  5     6  4